Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.Type Property
 Gets or sets the type of spacing. Does not allow change to exact spacing or number bars spacing.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSpacing.SpacingType Type { get; set; }
Public Property Type As RebarSpacing.SpacingType
	Get
	Set
Property Value
Type: RebarSpacing.SpacingType
See Also
Reference
RebarSpacing Class
Tekla.Structures.Model Namespace